### Pandas Data Type  
(1) Series  
(2) Data Frame

In [ ]:
import numpy as np
import matplotlib
import pandas as pd

### Series 형식
1차원 배열과 유사하다.  
색인(index)를 가지고 접근할 수 있다.

In [ ]:
import pandas as pd
x = pd.Series([7,3,5,8])
print(x)

In [ ]:
import pandas as pd
x = pd.Series([7,3,5,8], index=['서울', '대구', '부산', '광주'])
print(x)

In [ ]:
x[['서울', '부산']]
# x['서울']
# x[['서울']]

In [ ]:
print(x.index)

In [ ]:
print(x.values)

In [ ]:
# sorted(x.index)
sorted(x.values)

In [ ]:
import pandas as pd
x = pd.Series([7,3,5,8], index=['서울', '대구', '부산', '광주'])
# x = x.reindex(sorted(x.index))
x = x.reindex(['대구', '서울', '광주', '부산'])
print(x)

In [ ]:
# reindex()
x = x.reindex(sorted(x.values))
print(x)

In [ ]:
x = pd.Series([3,8,5,9], index=['서울', '대구', '부산', '광주'])
y = pd.Series([2,3,5,1], index=['대구', '부산', '서울', '대전'])
x+y

# 공통된 인덱스가 있어야 더할 수 있고, 없을경우 NaN 출력
# Nan = Not a number
# ?, N/A, NaN, 0, 빈칸 = 결축치 / 이상치

In [ ]:
medal = [1,3,2,4,2,3]
x = pd.Series(medal)
print(pd.unique(x))

In [ ]:
#딕셔너리 형태를 Series로 변환
age = {'민준' : 23, '현우' : 43, '서연' : 12, '동현' : 45}
x=pd.Series(age)
x

In [ ]:
names=['민준', '서연', '현우', '민서', '동현', '수빈']
pdata = pd.Series(names)
print(pdata)

In [38]:
names=['민준', '서연', '현우', '민서', '동현', '수빈']
pdata = pd.Series(names)
a=pdata[3:6]
# print(a.values)
print(a)

3    민서
4    동현
5    수빈
dtype: object

In [42]:
# 결과 예측
print(a[4])

동현

In [43]:
print(a)

3    민서
4    동현
5    수빈
dtype: object

In [44]:
names=['민준', '서연', '현우', '민서', '동현', '수빈']
pdata = pd.Series(names)
a=pdata[3:6]
print(a)
b=a[1:2]
print(b)

3    민서
4    동현
5    수빈
dtype: object
4    동현
dtype: object

- 슬라이싱은 일반 배열의 인덱스 형식으로 동작
- 그 외에는 Pandas Series의 인덱스 사용

### Data Frame

In [6]:
data = {'age':[23,43,12,45],
    'name':['민준','현우','서연','동현'],
    'height':[175.3, 180.3, 165.8, 172.7]}
    
x=pd.DataFrame(data, columns=['name','age', 'height'])
x

   age name  height
0   23   민준   175.3
1   43   현우   180.3
2   12   서연   165.8
3   45   동현   172.7

In [ ]:
x.name

In [7]:
ary = [[1,2],[3,4],[5,6]]
data = pd.DataFrame(ary, columns=['first', 'second'])
data

   first  second
0      1       2
1      3       4
2      5       6

In [8]:
# iloc
data.iloc[1]

first     3
second    4
Name: 1, dtype: int64

In [9]:
data.iloc[:, -1]

0    2
1    4
2    6
Name: second, dtype: int64

In [13]:
ary=[[1,2],[3,4],[5,6],[7,8],[9,10],[11,12]]
data = pd.DataFrame(ary, columns=['first', 'second'])
data.head(3)
# data

   first  second
0      1       2
1      3       4
2      5       6

In [14]:
data.tail(3)

   first  second
3      7       8
4      9      10
5     11      12

특정 항목만 선택하여 저장 및 출력하기

In [26]:
ary=[[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary, columns=['first', 'second'])
print(data)
bools=[False, True, True, False, True]
data.second[bools]

   first  second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

1     4
2     6
4    10
Name: second, dtype: int64

In [31]:
data = {'age':[23,43,12,45],
'name':['민준','현우','서연','동현'],
'height':[175.3, 180.3, 165.8, 172.7]}
x=pd.DataFrame(data, columns=['name','age', 'height'])
print(x)
print(x.mean(axis=0))

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7
age        30.750
height    173.525
dtype: float64

In [32]:
data = {'age':[23,43,12,45],
'name':['민준','현우','서연','동현'],
'height':[175.3, 180.3, 165.8, 172.7]}

x=pd.DataFrame(data, columns=['name','age', 'height'])

index=[True, False, True, False]
print(x[index])

  name  age  height
0   민준   23   175.3
2   서연   12   165.8

### Pandas Series, DataFrame 내의 데이터형

1. Objects : 문자 또는 문자열형
2. Int64 : 정수형
3. Float64 : 실수형

### Pandas 데이터의 형변환

In [40]:
import pandas as pd
import numpy as np
ary = [[1,2], [3,4], [5,6], [7,8],[9,10]]
data = pd.DataFrame(ary, columns=['수온', '상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [43]:
data['수온'] = data['수온'].astype('float')
print(data)

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [44]:
import pandas as pd
news = pd.read_csv('../Data Collection (Scraping)/news_result.csv')
news.head()

,news_title,news_link
0,"한은, 기준금리 동결…""코로나 불확실성 잠재""(종합2보)",http://yna.kr/AKR20210715061651002?did=1195m
1,"문재인 대통령, 청해부대원 코로나19 확진에 “현지 여건 안되면 국내 후송”",https://www.khan.co.kr/politics/president/arti...
2,"금통위, 코로나 확산에도 금리 인상 시그널..""통화완화 정도 조정할 것""(상보)",http://www.edaily.co.kr/news/newspath.asp?news...
3,"한은 금통위, 기준금리 0.5% 동결...코로나 4차 유행 감안",http://www.newsis.com/view/?id=NISX20210715_00...
4,"문 대통령, 청해부대 코로나 확진에 ""의료인력 신속투입""",https://news.sbs.co.kr/news/endPage.do?news_id...

In [45]:
import pandas as pd
data = pd.read_csv('./공공데이터활용지원센터_코로나19 예방접종센터 현황_20210716.csv', encoding='cp949')
data.head()
# utf-8 / cp949

,연번,센터유형,센터명,운영기관,시설명,우편번호,주소,사무실전화번호
0,1,중앙/권역,코로나19 중앙 예방접종센터,국립중앙의료원,국립중앙의료원 D동,4562,서울특별시 중구 을지로 39길 29,02-2260-7114
1,2,중앙/권역,코로나19 중부권역 예방접종센터,순천향대 천안병원,천안시 실내배드민턴장 1층,31212,충청남도 천안시 동남구 천안대로 357,NaN
2,3,중앙/권역,코로나19 호남권역 예방접종센터,조선대병원,조선대학교병원 의성관 5층,61452,광주광역시 동구 필문대로 365,062-220-3739
3,4,중앙/권역,코로나19 영남권역 예방접종센터,양산 부산대병원,양산 부산대병원 기숙사동 1층,50612,경상남도 양산시 물금읍 금오로 20,055-360-6701
4,5,지역,코로나19 대구광역시 중구 예방접종센터,NaN,계명대학교 대구동산병원 별관,41931,대구시 중구 달성로 56,053-661-3955

### 공공데이터포털에서 데이터를 받아와 Pandas로 읽어보자!

In [1]:
import pandas as pd
import numpy as np
from numpy import NaN
data = pd.DataFrame(np.arange(12).reshape(3,4), columns=['A', 'B', 'C', 'D'])
data.D[2] = 'NaN'
data

   A  B   C    D
0  0  1   2    3
1  4  5   6    7
2  8  9  10  NaN

In [ ]:
data.drop(['D'], axis=1)